#!/usr/bin/perl


use strict;
use CGI;

my $query = new CGI;
$query->charset('UTF-8');

print $query->header;

print $query->start_html('Стихоплет');



my @array_0=("Я ПОМНЮ", "НЕ ПОМНЮ", "ЗАБЫТЬ БЫ", "КУПИТЕ", "ОЧКУЕШЬ", "КАКОЕ", "УГРОБИЛ", "ХРЕНОВО", "ОТКРОЮ", "ТЫ ЧУЕШЬ ?"); 
my @array_1=("ЧУДНОЕ", "СТРАННОЕ", "НЕКОЕ", "ВКУСНОЕ", "ПЬЯНОЕ", "СВИНСКОЕ", "Ч0ТКОЕ", "СРАНОЕ", "НУЖНОЕ", "КОНСКОЕ");
my @array_2=("МНГНОВЕНЬЕ", "ЗАТМЕНЬЕ", "ХОТЕНЬЕ", "ВАРЕНЬЕ", "ТВОРЕНЬЕ", "ВЕЗЕНЬЕ", "РОЖДЕНЬЕ", "СМУЩЕНЬЕ", "ПЕЧЕНЬЕ", "УМЕНЬЕ");
my @array_3=("ПЕРЕДО МНОЙ", "ПОД КОСЯЧКОМ", "НА КЛАДБИЩЕ", "В МОИХ МЕЧТАХ", "ПОД СКАЛЬПЕЛЕМ", "В МОИХ ШТАНАХ", "ИЗ-ЗА УГЛА", "В МОИХ УШАХ", "В НОЧНОМ ГОРШКЕ", "ИЗ ГОЛОВЫ");
my @array_4=("ЯВИЛАСЬ ТЫ", "ДОБИЛАСЬ ТЫ", "ТОРЧАТ КРЕСТЫ", "СТИХОВ ЛИСТЫ", "ЗАБИЛАСЬ ТЫ", "МОИ ТРУСЫ", "ПОЮТ ДРОЗДЫ", "ИЗ ТЕМНОТЫ", "ПОМЫЛАСЬ ТЫ", "ДАЮТ ПИЗДЫ");
my @array_5=("МИМОЛЕТНОЕ", "ДЕТОРОДНОЕ", "ПСИХОТРОПНОЕ", "КАЙФОЛОМНОЕ", "ОЧЕВИДНОЕ", "У ВОРОБУШКОВ", "ЭДАКОЕ ВОТ", "НАМ НЕ ЧУЖДОЕ", "БЛАГОРОДНОЕ", "ЯБЫВДУЛЬСКОЕ");
my @array_6=("ВИДЕНЬЕ", "СИДЕНЬЕ", "ПАРЕНЬЕ", "СУЖДЕНЬЕ", "ВРАЩЕНЬЕ", "СНОШЕНЬЕ", "СМЯТЕНЬЕ", "ПЕЧЕНЬЕ", "ПАДЕНЬЕ", "СПЛЕТЕНЬЕ");
my @array_7=("ГЕНИЙ", "СТОРОЖ", "СИМВОЛ", "СПАРТА", "ПРАВДА", "АНГЕЛ", "ВОДКА", "ПИВО", "АХТУНГ", "ЖОПА");
my @array_8=("ЧИСТОЙ", "ВЕЧНОЙ", "ТУХЛОЙ", "ПРОСИТ", "ГРЯЗНОЙ", "ЛИПКОЙ", "НА ХРЕН", "В ПЕНЕ", "ЖЕНСКОЙ", "ЖАЖДЕТ");
my @array_9=("КРАСОТЫ", "МЕРЗЛОТЫ", "CУЕТЫ", "НАРКОТЫ", "СРАМОТЫ", "ШКОЛОТЫ", "ТИПА ТЫ", "ПРОСТОТЫ", "ХУЕТЫ", "НАГОТЫ");

my @vocabular=(\@array_0,\@array_1,\@array_2,\@array_3,\@array_4,\@array_5,\@array_6,\@array_7,\@array_8,\@array_9);
my $voca_ref = \@vocabular;

my @rand_values=(rand(9),rand(9),rand(9),rand(9),rand(9),rand(9),rand(9),rand(9),rand(9),rand(9));


print "${${$voca_ref }[0]}[$rand_values[0]] ${${$voca_ref }[1]}[$rand_values[1]] ${${$voca_ref }[2]}[$rand_values[2]]<br>";
print "${${$voca_ref }[3]}[$rand_values[3]] ${${$voca_ref }[4]}[$rand_values[4]]<br>";
print "КАК ${${$voca_ref }[5]}[$rand_values[5]] ${${$voca_ref }[6]}[$rand_values[6]],<br>";
print "КАК ${${$voca_ref }[7]}[$rand_values[7]] ${${$voca_ref }[8]}[$rand_values[8]] ${${$voca_ref }[9]}[$rand_values[9]]<br>";



print $query->end_html;

exit;

